package by.practical2.individual2;

public class Matrix {
    public static void main(String[] args){
        int[][] arr = {{1,2,0,4,0},{6,7,0,9,0},{0,0,0,0,0},{16,17,0,19,0},{21,22,0,24,0}};                                // создаём матрицу 5х5
        int l=0,index=0,str = arr.length,col = arr.length;                                                                    // l - для подсчёта 0 в строке
                                                                                                                              // index - индекс для записи, в какой строке находится строка с 0
                                                                                                                              // str и col - для создания временного массив, в который будут записываться
                                                                                                                              // все числа кроме 0
        int[][] temp = new int[arr.length][arr.length];                                                                       // временный массив размер как и матрица
        boolean m = true;


        for(int i=0;i<arr.length;i++){                                                                                        // вывод матрицы в консоль
            for(int j=0;j< arr.length;j++){
                System.out.print(arr[i][j]+" ");
            }
            System.out.println();
        }

        System.out.println("********************************************************************************************");

        /** ----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * ------------------------------------------Удаляем строки(если есть)----------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * */


        do{                                                                                                                  // цикл для нескольких проходов по матрице и поиске строк с 0
            l=0;                                                                                                             // обнуление счётчика нулей
            m = true;                                                                                                        // флаг - для проверки матрицы на 0, переключается, если в матрице нет строк с 0
            str = arr.length;                                                                                                // записываем количество строк матрицы в str для временного массива
            col = arr[0].length;                                                                                             // записываем кол-во столбцов матрицы в col для временного массива
            for(int i=0;i< arr.length;i++){
                for(int j=0;j< arr[0].length;j++){
                    if(arr[i][j]==0) {                                                                                       // если в строке найден 0
                        l++;                                                                                                 // l - увеличивается
                    }
                }
                if(l==arr[0].length) {                                                                                       // сразу же после строчки проверяем, вся ли строка состоит из 0
                    index = i;                                                                                               // запоминаем номер строки
                    str--;                                                                                                   // уменьшаем временный массив, так как строку с 0 записывать не будем
                    m = false;                                                                                               // указываем флагу, что нашли 0 и после перестановки нужно будет ещё раз проверить матрицу
                    break;                                                                                                   // останавливает цилк для проверки матрицы, т.к. необходимо удалить строку с 0
                }
                l=0;
            }
            if(l==arr[0].length) {                                                                                           // чтоб проверка не срабатывала даже если 0 в матрице нет, проверяем еще раз на всякий случай
                temp = new int[str][col];                                                                                    // задаём размер временного массива с уже обновленным кол-вом строк
                if (index == 0) {                                                                                            // если строка с 0 в матрица на первом месте
                    for (int i = 1; i < arr.length; i++) {
                        for (int j = 0; j < arr[0].length; j++) {
                            temp[i-1][j] = arr[i][j];                                                                        // записываем во временный массив на 1 место, но со 2 места матрицы
                        }
                    }
                } else if (index == arr.length-1) {                                                                          // если строка 0 в матрице на последнем месте
                    for (int i = 0; i < str; i++) {
                        for (int j = 0; j < col; j++) {
                            temp[i][j] = arr[i][j];                                                                          // записываем до последней строчки матрицы
                        }
                    }
                } else {                                                                                                     /** если в середине матрицы */
                    for(int i=0;i<index;i++){                                                                                // записываем из матрицы до строки, в которой 0
                        for(int j=0;j< arr[0].length;j++){
                            temp[i][j] = arr[i][j];
                        }
                    }
                    for(int i=index; i < str;i++){                                                                           // записываем с начала строки но из матрицы на строку ниже
                        for(int j=0; j < arr[0].length;j++){
                            temp[i][j] = arr[i+1][j];
                        }
                    }
                }
                l=0;                                                                                                         // обнуляем счётчик
                arr = new int[str][col];                                                                                     // заново выделяем память под матрицу, но уже с размером без 0
                arr = temp;                                                                                                  // копируем в "матрицу" временный массив
            }
            l=0;
        }while(!m);

        System.out.println("Обновлённый массив: ");
        for(int i=0;i< arr.length;i++){
            for(int j=0;j< arr[0].length;j++){
                System.out.print(arr[i][j]+" ");
            }
            System.out.println();
        }

        System.out.println("********************************************************************************************");
        /** ----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * ------------------------------------------Теперь удаляем столбцы(если есть)--------------------------------------------------------------
         * ---------------------------------------------Аналогично как и со строками----------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * -----------------------------------------------------------------------------------------------------------------------------------------
         * */

        do{
            m = true;
            str = arr.length;
            col = arr[0].length;
            for(int i=0;i< arr[0].length;i++){
                for(int j=0;j< arr.length;j++){
                    if(arr[j][i]==0) {
                        l++;
                    }
                }
                if(l==arr.length) {
                    index = i;
                    col--;
                    m = false;
                    break;
                }
                l=0;
            }
            if(l==arr.length) {
                temp = new int[str][col];
                if (index == 0) {
                    for (int i = 1; i < arr[0].length; i++) {
                        for (int j = 0; j < arr.length; j++) {
                            temp[j][i-1] = arr[j][i];
                        }
                    }
                } else if (index == arr[0].length-1) {
                    for (int i = 0; i < col; i++) {
                        for (int j = 0; j < str; j++) {
                            temp[j][i] = arr[j][i];
                        }
                    }
                } else {
                    for(int i=0;i<index;i++){
                        for(int j=0;j < str;j++){
                            temp[j][i] = arr[j][i];
                        }
                    }
                    for(int i=index; i < col;i++){
                        for(int j=0; j < arr.length;j++){
                            temp[j][i] = arr[j][i+1];
                        }
                    }
                }
                l=0;
                arr = new int[str][col];
                arr = temp;
            }
        }while(!m);

        System.out.println("Обновлённый массив: ");
        for(int i=0;i< arr.length;i++){
            for(int j=0;j< arr[0].length;j++){
                System.out.print(arr[i][j]+" ");
            }
            System.out.println();
        }
    }
}
